# Curves Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Truss..::..Curves Property
Truss Class See Also
---
Get all the truss curves.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveArray Curves { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Curves As CurveArray
	Get
```

Visual C++
---
```text
public:
property CurveArray^ Curves {
	CurveArray^ get ();
}
```

# ### Return Value
The Curves property returns a CurveArray that contains all the truss curves.
# See Also
Truss Class
Autodesk.Revit.DB.Structure Namespace